from fuzzywuzzy import fuzz
from fuzzywuzzy import process

list_elena = [
    "3S Group",
    "AB Development",
    "AEON",
    "AFI",
    "Ant Development",
    "Apsis Globe",
    "Baza",
    "Capital group",
    "Coldy",
    "DAR",
    "ENGEO Development",
    "Era One Holding",
    "Forma",
    "Glorax",
    "Hutton Development",
    "IKON",
    "INSIGMA",
    "LEGENDA",
    "Level",
    "Metrofond Development",
    "MR",
    "October Group",
    "Optima Development",
    "Pioneer",
    "Sense",
    "Sezar Group",
    "Sminex",
    "St. Michael",
    "Stenoy",
    "Tekta",
    "Touch",
    "UDS",
    "UNIQ Development",
    "Upside Development",
    "Vesper",
    "VOS’HOD",
    "А101",
    "Абсолют",
    "Автотех",
    "Агрострой",
    "Айгрин",
    "Аквилон",
    "Атлант",
    "Балтийская Строительная Компания",
    "Бесткон",
    "Брусника",
    "Ви Холдинг",
    "Галс",
    "ГК Sun Development",
    "ГК СтройИнновация",
    "Главстрой",
    "Горакс",
    "Гравион",
    "Град",
    "Гранель",
    "Группа Родина",
    "Доминанта",
    "Донстрой",
    "Еврофармакол",
    "ИнвестТраст",
    "ИП",
    "Кортрос",
    "КРОСТ",
    "ЛСР",
    "Мангазея",
    "МонАрх",
    "Мосреалстрой",
    "Неострой",
    "Основа",
    "ПАТЕК Групп",
    "ПИК",
    "Плюс девелопмент",
    "Прайм Лайф",
    "Равновесие Капитал",
    "РГ",
    "Регионы",
    "Ренессанс",
    "РКС Девелопмент",
    "Рост",
    "РСТИ",
    "Русич",
    "С3 Ключ",
    "Самолет",
    "СЗ 5 ДОНСКОЙ",
    "СЗ БАЛЧУГ ЭСТЕЙТ",
    "СЗ Киноцентр",
    "СЗ Рублево-Архангельское",
    "СЗ Третий Рим",
    "СЗ Универсаль",
    "СЗ Экран",
    "СЗ Элита-Эко",
    "Сибпромстрой",
    "СИСдевелопмент",
    "СИТ",
    "Стадион Спартак",
    "Стоун",
    "Страна Девелопмент",
    "Строй мир",
    "Строй Сервис",
    "Сумма Элементов",
    "Ташир",
    "ТК Алладин",
    "Трансстройинвест",
    "Трастком Девелопмент",
    "УНР 494",
    "ФСК",
    "Центр-Инвест",
    "Центрстрой",
    "ЭЗКС",
    "Энергостройинвест",
    "Эталон",
    "Юникей"
]

list_max = ['Доходный дом', 'ФСК', 'ПИК', 'ПРОФИ-Инвест', 'Сити 21 век', 'AFI', 'VOS’HOD', 'Alcon', 'Stenoy', 'Главстрой', 'Аквилон', 'Capital group', 'Apsis Globe', 'КРОСТ', 'Ташир', 'Центр-Инвест', 'РСТИ', 'Основа', 'Tekta', 'СЗ 5 ДОНСКОЙ', '3S Group', 'Sminex', 'Sezar Group', 'Кортрос', 'MR', 'Pioneer', 'Гранель', 'РКС Девелопмент', 'October Group', 'Level', 'Sense ', 'Vesper', 'Абсолют', 'Forma', 'Эталон', 'Ренессанс', 'Самолет', 'AEON', 'Группа Родина', 'Энергостройинвест', 'IKON ', 'Capital Group', 'СЗ Киноцентр', 'Еврофармакол', 'Ant Development', 'ЛСР', 'Равновесие Капитал', 'AB Development', 'Страна Девелопмент', 'Э.К. Девелопмент', 'Инвестстройкомплекс', 'МонАрх', 'Выбор', 'Wainbridge', 'Ви Холдинг', 'СтройИнновация', 'СМУ-6', 'Остов', 'ГК Березовец', 'Glorax', 'Hutton Development', 'ЮР-Инвест', 'Д-Инвест', 'Бэсткон', 'СИТ', 'С3 Ключ', 'А101', 'РГ', 'Glincom', 'Авиаспецресурс', '3-RED', 'InReit', 'Фонд развития территорий', 'ТКС риэлти', 'Град', 'Зеленый сад', 'М1 Девелопмент', 'АМ Девелопмент', 'Плюс девелопмент', 'Джи Три Илинский', 'Стройсоюз', 'PHOENIX', 'БЭЛ', 'Галс', 'Сумма Элементов', 'Соцпромстрой', 'Р-Инвест', 'Арткласс Строй', 'Мегалит', 'СЗ Элита-Эко', 'Galaxy Group', 'Регионы', 'Техноолимпстрой', 'Тренд групп', 'МФС-6', 'ГК СтройИнновация', 'ИММО ДЕВЕЛОПМЕНТ', 'St. Michael', 'Ругрупп Девелопмент', 'ИП', 'Новая Жизнь', 'Мосреалстрой', 'УЭЗ', 'Мангазея', 'Галакс+', 'Русич', 'Ареал', 'Ферро-строй', 'Гранд', 'Брусника', 'Сетьстрой', 'Восток-Девелопмент', 'Киноквартал', 'BTR Group', 'ИП Кравченко А. В.', 'ТехноСтройОлимп', 'СМУ-6 Инвестиции', 'СЗ Универсаль', 'ПАТЕК Групп', 'Патек Групп', 'ГАЛС', 'СЗ Скала', 'Стройпромавтоматика', 'Gravion', 'Metrofond Development', 'ЭЗКС', 'Некрасовка Девелопмент', 'СУ-10', 'РП-Строй', 'ДОМ РФ', 'Magnum', 'СЗ ЛИТЕЙНЫЙ.ЛАЙФ', 'Империал', 'Садовое кольцо ', 'MySpace Development', 'УНР 494', 'Маяк', 'Мега-мечта', 'Фонд', 'Ю-Инвест', 'Стройспецмонтаж', 'Sun Development', 'ПРОКСИМА-1', 'СПСИТИ', 'Ломоносов Девелопмент', 'KR Properties', 'Coldy', 'Флэт и Ко', 'Отрада Девелопмент', 'Квартал-Инвестстрой', 'СЗ АВЕРУС', 'Атлант', 'Замитино', 'Рост', 'MS Group', 'RDI', 'Агрострой', 'ИнвестТраст', 'Pioneer Finance', 'Ипотечная компания М-6', 'Вектор', 'Доходный Дом', 'ГК Развитие', 'Донстрой', 'Инвестстрой', 'Автотех', 'Сибпромстрой', 'Прайм Лайф', 'КОМФОРТИНВЕСТ', 'ООО Жилстрой', 'ГК Волжский Домостроительный Комбинат', 'РК-Газсетьсервис', 'БЭСТКОН', 'СЗ-Полет', 'Optima Development', 'ДМ Холдинг', 'Стадион Спартак', 'СЗ Комета', 'DOGMA', 'СЗ Бест-Проект', 'МОД', 'Арс', 'Монолит КапиталСтрой', 'ООО ТК Алладин', 'КОВАКС', 'СЗ Риверхаус', 'Юнион', 'Сантерра', 'СЗ Рублево-Архангельское', 'Seven Suns Development', 'LEGENDA ', 'Трансстройинвест', 'Стройтехинвест', 'Айгрин', 'СЗ МАГИ', 'Флагман', 'Снегири девелопмент', 'Мессиер-Девелопмент', 'ООО СЗ ЖК 2/1', 'Стройтек', 'ОМ Девелопмент', 'СК Межрегионстрой', 'Управление делами президента Российской Федерации', 'Крост', 'INSIGMA', 'Инвестсити', 'Корпорация ВИТ', 'Берендей', 'СЗ ИРИСТОН', 'Ин-Групп', 'РКП', 'PPF Real Estate', 'Стройтэкс', 'Аврора', 'Touch', 'СМУ-29', 'ГК Архитектор', 'РосЕвроСити', 'Велесстрой', 'Центрстрой', 'Римэка', 'TPI Company', 'Гефест', 'Монолит', 'Веста', 'СЗ Т-ОТЕЛЬ', 'TOUCH', 'Upside Development', 'Гравион', 'Строй мир', 'Доминанта', 'UDS', 'DAR', 'UNIQ Development', 'Монарх', 'СК ВЫБОР', 'Легион', 'ГК Sun Development', 'Березовец', 'СЗ Глобалмытищи', 'СЭСМА', 'Бесткон', 'Девелопмент 54', 'СтартСК', 'МОСОБЛСТРОЙ-24', 'ГРАД', 'СЗ МАИС', 'Альфа Проджект', 'Строй Сервис', 'Магнум', 'Юникей', 'Атлантис Скай', 'СИСдевелопмент', 'ТК Алладин', 'ПСК НПО Машиностроения', 'Горакс', 'Стоун', 'Среда', 'Era One Holding', 'Новое время', 'ENGEO Development', 'Балтийская Строительная Компания', 'СЗ Третий Рим', 'ЦентрЖилСервис-2012', 'СЗ Экран', 'СЗ БАЛЧУГ ЭСТЕЙТ', 'Baza', 'Премьера', 'Неострой', 'Трастком Девелопмент', 'АРС', 'ГК АльфаСтройИнвест', 'Виктория-Девелопмент', 'Инград', 'Догма', 'Статус']



threshold = 50

matches = {}
not_matched = []

for item in list_elena:
    match, score = process.extractOne(item, list_max, scorer=fuzz.token_sort_ratio)
    if score >= threshold and score != 100:
        # Получаем оригинальное (русское) имя по индексу
        matches[item] = match
    if score < threshold:
        not_matched.append(item)

# Печать результатов


print(matches)
print(not_matched)


