new = {"CITYZEN" - "СИТИДЗЕН",
"Mod" - "Мод",
"Frank's house" - "Дом Франка",
"Clos 17" - "Кло 17",
"LUCE" - "Люче",
"Moments" - "МОМЕНТС",
"Nicole" - "Николь",
"PAVE" - "ПЕЙВ",
"Portland" - "ПОРТЛЕНД",
"Republic" - "Репаблик",
"Symphony 34" - "Симфония 34",
"Soul" - "СОУЛ",
"CRYSTAL Трилогия" - "Трилогия Кристалл",
"Famous" - "Феймос",
"SIGNAL" - 'Сигнал'
'BESIDE 2.0' - 'Бисайд 2.0'
"Nexus" - 'Нексус от Аквилон'
"Indy Towers" - 'Инди Тауэрз от Аквилон'
'ЛОТ от Аквилон'
'BESIDE - Бисайд'       
'Sky Garden' - 'Скай Гарден'
'Rotterdam' - 'Роттердам'
'Amber City' - 'Амбер Сити'
'Sydney Prime' - 'Сидней Прайм'
"The LAKE" - 'Лэйк'
'Sydney City' - 'Сидней Сити'
'City Bay' - 'Сити Бэй'
'CITYZEN' - 'Ситизен'
'Jois' - 'Джойс'
'VEER' - 'Веер'
'Mod' - 'Мод'
'SET' - 'Сет'
'Symphony 34' - 'Симфони 34'
'SLAVA' - 'Слава'
'FORUM' - 'Форум'
'Famous' - 'Феймос'
'One' - 'ОНЕ'
'DOM' - 'Дом на Часовой'       
"Beluck Коломенское" - "Гранель Коломенское"
"MYPRIORITY Мневники" - "Мнёвники от Гранель"
"MYPRIORITY Нижегородская" - "Нижегородская от Гранель"
"MYPRIORITY Павелецкая" - "Павелецкая от Гранель"
"MYPRIORITY Дубровка" - "Дубровка от Гранель"
"MYPRIORITY Басманный" - "Басманный от Гранель"       
'Very на Ботанической' - 'ВЭРИ на Ботанической'
'Nametkin tower' - 'НАМЕТКИН ТАУЭР'       
"Foreville" - 'Форевиль'
"Voice Towers" - 'ВОЙС'
"ERA" - 'ЭРА'
'Shagal' - 'Шагал',
"Shagal Residence" - 'Резиденция Шагал',
"Voxhall" - 'Воксхолл'
"WAVE" - 'ВЕЙВ'  
'Injoy' - 'Инджой'
'Дом MALEVICH' - 'Дом МАЛЕВИЧ'
'Holland park' - 'Холланд парк'
"NOVA" - 'НОВА'
"DIUS" - 'Диус'       
"Deco Residence" - 'Деко Резиденс'
"Legacy" - 'Легаси'
"Stellar City" - 'Стеллар Сити'
'West Tower' - 'Вест Тауэр'
"Citi-Mix" - 'СИТИМИКС'             
'River Park Towers Кутузовский' - 'Ривер Парк Кутузовский'
"Сокольники" - 'СТОУН Сокольники'
"Stone Rise" - 'СТОУН Райз'
"West Tower" - 'Вест Тауэр'
"Twelve" - 'Твелв'
"Симоновский вал" - 'Симоновский Вал'
"Level Южнопортовая" - "Левел Южнопортовая" 
"Level Павелецкая Сити" - "Левел Павелецкая Сити"
"Level Академическая" - "Левел Академическая"
"Level Бауманская" - "Левел Бауманская"
"Level Войковская" - "Левел Войковская"
"Level Звенигородская" - "Левел Звенигородская"
"Level Лесной" - "Левел Лесной"
"Level Мичуринский" - "Левел Мичуринский"
"Level Нагатинская" - "Левел Нагатинская"
"Level Нижегородская" - "Левел Нижегородская"
"Level Селигерская" - "Левел Селигерская"
'Level Причальный' - 'Левел Причальный'
'Sky Sputnik' - 'Скай Спутник'
'AURUS Residences' - 'АУРУС Резиденции'       
'balance' - 'баланс'
'AHEAD' - 'АХЭД'
'Five Towers' - 'Файв Тауэрс'
'ARTEL' - 'АРТЕЛЬ'
'KING & SONS' - 'КИНГ&САНС'
'PHANTOM' - 'ФАНТОМ'
'Stories на Мосфильмовской' - 'СТОРИС на Мосфильмовской'














       }












