name_dict = {'Сити Микс-Новокосино': 'СитиМикс Новокосино', 'Найс Лофт': 'Найс лофт', 'Cityzen': 'CITYZEN',
             'Jois': 'JOIS',
             'Павелецкая сити': 'Павелецкая Сити', 'Эко Видное 2.0': 'У реки. Эко Видное 2.0',
             'Квартал Серебряный Бор': 'Квартал Серебряный бор', 'Indy Towers ': 'Indy Towers',
             'Две столицы': 'Сердце Столицы', 'Новое Вашутино': 'Новое Видное',
             'AFI Park Воронцовский': 'AFI Park «Воронцовский', 'Квартал «Издание»': 'Квартал «Издание',
             'Квартал «Метроном»': 'Квартал «Метроном', 'Квартал «МОНС»': 'Квартал «МОНС',
             'Измайловский парк': '1-й Измайловский', 'Малаховский': 'Михалковский',
             'Новая Алексеевская Роща': 'Новая Алексеевская роща', 'РЕКА': 'Река', 'Событие-2': 'Событие',
             'Событие-3': 'Событие', 'Событие-4': 'Событие', 'Headliner': 'headliner', 'Tate': 'tate',
             'ЗИЛАРТ': 'Зиларт', 'Никольский квартал отрада ': 'Никольский квартал',
             'Аист Резиденс': 'Аист резиденс', 'Мой адрес на Вертолетчиков': 'На вертолетчиков',
             'Белая дача парк': 'Белая Дача парк', 'Зелёный парк': 'Зеленый парк',
             'Петровский парк II': 'Петровский парк ',
             'Котельники парк': 'Котельники Парк', 'РУСИЧ Кантемировский': 'Кантемировский',
             'Космический квартал': 'Космический Квартал', 'Цветочные поляны': 'Цветочные Поляны',
             'Voxhall ': 'Voxhall', 'Mariinn Park ': 'Mariinn Park', 'Nagatino i': 'Nagatino i-Land',
             'Shagal ': 'Shagal',
             'Riversky': 'RiverSky', 'Лужники Коллекшн': 'LUZHNIKI', 'Monodom Lake': 'Апарт-комплекс Monodom Lake',
             'Аквилон SIGNAL': 'SIGNAL', 'Аквилон BESIDE': 'BESIDE', 'Аквилон BESIDE 2.0': 'BESIDE 2.0',
             'Аквилон Митино': 'Митино', 'Баланс': 'balance', 'Хайд': 'Hide',
             'Новая Звезда-2': 'Новая Звезда', 'Новая Звезда, II очередь': 'Новая Звезда',
             'Мой адрес в Ватутинках': 'В Ватутинках', 'Мой адрес в Зеленограде': 'В Зеленограде',
             'Мой адрес на Амурской': 'На Амурской', 'Мой адрес на Варшавском 139': 'На Варшавском 139',
             'Мой адрес на Дмитровском 89': 'На Дмитровском 89', 'Мой адрес на Клинской': 'На Клинской',
             'Мой адрес на Люблинской 80 к7': 'На Люблинской 80 к7',
             'Мой адрес на Профсоюзной з/у 60/1': 'На Профсоюзной з/у 60/1',
             'Мой адрес на Салтыковской': 'На Салтыковской',
             'Мой адрес на Соколиной Горе': 'На Соколиной Горе', 'Мой адрес на Шелихова 9': 'На Шелихова 9',
             'Мой адрес на Щелковском 90к1': 'На Щелковском 90к1',
             'Мой адрес на Большой Филевской': 'На Большой Филевской',
             'UNO. Соколиная гора': 'UNO, Соколиная гора', 'UNO. Головинские пруды': 'UNO, Головинские пруды',
             'Лес': 'Комплекс апартаментов LES', 'Левел Лесной (Микрогород в лесу)': 'Level Лесной',
             'Элевен': 'Дизайнерский дом Eleven', 'Доро Милле': "D'ORO MILLE", 'Диалог': 'Dialog',
             'Лаврушинский 5': 'Лаврушинский', 'Белый град (Белый мыс)': 'Белый град', 'EVO': 'ЭВО',
             'Сколково Ван (Заречный квартал)': 'Skolkovo one', 'Liberty': 'Либерти', 'Влюберцы апарт-комплекс':
                 'Влюберцы', 'Гостиничный комплекс Аметист': 'Аметист', 'Лесная Отрада 2-я очередь': 'Отрада Лесная',
             'Облака 2.0': 'Облака', 'Riga Hills': 'Рига Хиллс', 'КИТ' : 'Кит'
             }

developer_dict = {'ООО ТК Алладин': 'ТК Алладин',
                  'Pioneer Finance': 'Pioneer',
                  'AFI Development': 'АФИ',
                  'ДСК': 'ФСК',
                  'Тройка Рэд': '3-RED',
                  'MR Group': 'MR',
                  'Садовое Кольцо': 'Садовое кольцо ГК',
                  'Садовое кольцо': 'Садовое кольцо ГК',
                  'Патек Групп': 'ПАТЕК Групп',
                  'AEON': 'Аеон',
                  '494УНР': '494 УНР',
                  'Glorax': 'GloraX',
                  'Capital group': 'Capital Group',
                  'Bestcon': 'Бесткон',
                  'Coldy': 'Колди',
                  'Колди (Coldy)': 'Колди',
                  'МонАрх': "Монарх",
                  'Среда ': 'Среда',
                  'SisDevelopment': 'СИСдевелопмент',
                  'STONE': 'Стоун',
                  'Sun Development': 'ГК Sun Development',
                  'Левел': 'Level',
                  'Regions Development': 'Регионы',
                  'ООО «СЗ УНИВЕРСАЛЬ»': 'СЗ Универсаль',
                  '1-ДСК': 'ФСК',
                  'КРОСТ': 'Крост',
                  'ГК Березовец': 'Березовец',
                  'Девелопмент 120' : 'Девелопмент 54',
                  'Инвест-Строй' : 'Инвестстрой',
                  'Ругрупп Девелопмент' : 'Альфа Проджект',
                  'BTR Group' : 'БТР Групп',
                  'DOGMA' : 'Догма',
                  'Magnum' : 'Магнум',
                  'RDI' : 'Ар Ди Ай',
                  'Инвестстройкомплекс' : 'Инвестстрой',
                  'Ипотечная компания М-6' : 'Стройтек',
                  'ПроГород' : 'Level',
                  'УК СЕТЬСТРОЙ БАЛАШИХА' : 'Сетьстрой',
                  'СЗ Элита-Эко' : 'Имена',
                  'Град' : 'ГРАД'}

import pandas as pd
import pyxlsb

file_path = r"C:\Users\Mi\OneDrive\Desktop\База\Feb-april_filled.xlsx"
df = pd.read_excel(file_path)

# Замена значений в столбце "Название проекта "
df['Дата обновления'] = pd.to_datetime(df['Дата обновления'], dayfirst=True, errors='coerce')
df["Название проекта "] = df["Название проекта "].replace(name_dict)
df["Девелопер"] = df["Девелопер"].replace(developer_dict)

# Сохранение результата в новый файл
df.to_excel("Feb-april_filled.xlsx", index=False)
