region_list = [
    1, 2, 4593, 4588, 4584, 4596, 4606, 4608, 4618, 4560, 4609, 4619, 181462,
    4564, 4581, 4620, 4607, 4557, 4623, 4612, 4573, 4598, 4585, 4555,
    4567, 4621, 4587, 4605, 4568, 4625, 184723, 4604, 4576, 4574, 4603,
    4602, 4562, 4561, 4565, 4601, 4636, 4599, 4629, 4580, 4630, 4572,
    4615, 4614, 4591, 4553, 4635, 4624, 4570, 4583, 4566, 4600, 4554,
    4556, 4558, 4563, 4569, 5053, 4571, 4575, 4577, 4578, 4579, 4582,
    4586, 4589, 4590, 4592, 4594, 4595, 4597, 4610, 4611, 4613, 4617,
    4622, 4627, 4628, 4631, 4633, 4634
]


'''
Москва и МО – 4593
СПб и ЛО – 4588
Краснодарский край – 4584
Нижегородская область – 4596
Ростовская область – 4606
Самарская область – 4608
Татарстан – 4618
Башкортостан – 4560
Саратовская область – 4609
Тверская область – 4619
Крым – 181462
Владимирская область – 4564
Кировская область – 4581
Томская область – 4620
Рязанская область – 4607
Архангельская область – 4557
Тюменская область – 4623
Свердловская область – 4612
Кабардино-Балкария – 4573
Новосибирская область – 4598
Красноярский край – 4585
Алтайский край – 4555
Воронежская область – 4567
Тульская область – 4621
Курская область – 4587
Псковская область – 4605
Дагестан – 4568
Ульяновская область – 4625
Севастополь – 184723
Приморский край – 4604
Калужская область – 4576
Калининградская область – 4574
Пермский край – 4603
Пензенская область – 4602
Брянская область – 4562
Белгородская область – 4561
Волгоградская область – 4565
Орловская область – 4601
Ярославская область – 4636
Омская область – 4599
ХМАО – 4629
Кемеровская область – 4580
Челябинская область – 4630
Иркутская область – 4572
Ставропольский край – 4615
Смоленская область – 4614
Марий Эл – 4591
Адыгея – 4553
ЯНАО – 4635
Удмуртия – 4624
Ивановская область – 4570
Костромская область – 4583
Вологодская область – 4566
Оренбургская область – 4600
Республика Алтай – 4554
Амурская область – 4556
Астраханская область – 4558
Бурятия – 4563
Еврейская АО – 4569
Забайкальский край – 5053
Ингушетия – 4571
Калмыкия – 4575
Камчатский край – 4577
Карачаево-Черкесия – 4578
Карелия – 4579
Коми – 4582
Курганская область – 4586
Липецкая область – 4589
Магаданская область – 4590
Мордовия – 4592
Мурманская область – 4594
Ненецкий АО – 4595
Новгородская область – 4597
Саха (Якутия) – 4610
Сахалинская область – 4611
Северная Осетия – 4613
Тамбовская область – 4617
Тыва – 4622
Хабаровский край – 4627
Хакасия – 4628
Чечня – 4631
Чувашия – 4633
Чукотский АО – 4634
'''